In [5]:
import pandas as pd

In [6]:
GDPPC = pd.read_csv('Data/Clean/Economic/GDPPC.csv')

In [7]:
GDPPC.columns.values[2] = 'GDPPC'
GDPPC.head()

                       country  year        GDPPC
0                        Aruba  1960          NaN
1  Africa Eastern and Southern  1960  1184.278679
2                  Afghanistan  1960          NaN
3   Africa Western and Central  1960  1088.785252
4                       Angola  1960          NaN

In [8]:
GDP_Growth = pd.read_csv('Data/Clean/Economic/GDP_Growth.csv')

In [9]:
GDP_Growth.columns.values[2] = 'GDP_Growth'
GDP_Growth.head()

                       country  year  GDP_Growth
0                        Aruba  1960         NaN
1  Africa Eastern and Southern  1960         NaN
2                  Afghanistan  1960         NaN
3   Africa Western and Central  1960         NaN
4                       Angola  1960         NaN

In [10]:
GINI = pd.read_csv('Data/Clean/Economic/GINI.csv')

In [11]:
GINI.columns.values[2] = 'GINI'
GINI.head()

                       country  year  GINI
0                        Aruba  1960   NaN
1  Africa Eastern and Southern  1960   NaN
2                  Afghanistan  1960   NaN
3   Africa Western and Central  1960   NaN
4                       Angola  1960   NaN

In [12]:
Gov_Debt = pd.read_csv('Data/Clean/Economic/Gov-Debt.csv')

In [13]:
Gov_Debt.columns.values[2] = 'Gov_Debt'
Gov_Debt.head()

                       country  year  Gov_Debt
0                        Aruba  1960       NaN
1  Africa Eastern and Southern  1960       NaN
2                  Afghanistan  1960       NaN
3   Africa Western and Central  1960       NaN
4                       Angola  1960       NaN

In [14]:
Inflation = pd.read_csv('Data/Clean/Economic/Inflation.csv')

In [15]:
Inflation.columns.values[2] = 'Inflation'
Inflation.head()

                       country  year  Inflation
0                        Aruba  1960        NaN
1  Africa Eastern and Southern  1960        NaN
2                  Afghanistan  1960        NaN
3   Africa Western and Central  1960        NaN
4                       Angola  1960        NaN

In [16]:
Life_Exp = pd.read_csv('Data/Clean/Economic/Life_Exp.csv')

In [17]:
Life_Exp.columns.values[2] = 'Life_Exp'
Life_Exp.head()

                       country  year   Life_Exp
0                        Aruba  1960  64.152000
1  Africa Eastern and Southern  1960  44.085552
2                  Afghanistan  1960  32.535000
3   Africa Western and Central  1960  37.845152
4                       Angola  1960  38.211000

In [18]:
Unemployment = pd.read_csv('Data/Clean/Economic/Unemployment.csv')

In [19]:
Unemployment.columns.values[2] = 'Unemployment'
Unemployment.head()

                       country  year  Unemployment
0                        Aruba  1960           NaN
1  Africa Eastern and Southern  1960           NaN
2                  Afghanistan  1960           NaN
3   Africa Western and Central  1960           NaN
4                       Angola  1960           NaN

In [20]:
Edu = pd.read_csv('Data/Clean/Economic/Edu.csv')

In [21]:
Edu.columns.values[2] = 'Edu'
Edu.head()

   country  year   Edu
0  Algeria  1950  0.85
1  Algeria  1955  0.84
2  Algeria  1960  0.88
3  Algeria  1965  1.10
4  Algeria  1970  1.55

In [22]:
# Storing all DataFrames in a list
dfs = [GDPPC, GDP_Growth, GINI, Gov_Debt, Inflation, Life_Exp, Unemployment, Edu]  # Add more DataFrames to this list

# Initialize the merged DataFrame with the first DataFrame in the list
main_df = dfs[0]

# Iteratively merge each DataFrame in the list
for df in dfs[1:]:
    main_df = pd.merge(main_df, df, on=['country', 'year'])

In [23]:
main_df.head()

,country,year,GDPPC,GDP_Growth,GINI,Gov_Debt,Inflation,Life_Exp,Unemployment,Edu
0,Afghanistan,1960,NaN,NaN,NaN,NaN,NaN,32.535,NaN,0.37
1,Albania,1960,NaN,NaN,NaN,NaN,NaN,54.439,NaN,2.98
2,United Arab Emirates,1960,NaN,NaN,NaN,NaN,NaN,48.811,NaN,1.51
3,Argentina,1960,7410.305029,NaN,NaN,NaN,NaN,63.978,NaN,5.67
4,Armenia,1960,NaN,NaN,NaN,NaN,NaN,61.431,NaN,7.91

In [24]:
Econ_data = main_df
Econ_data.head()

,country,year,GDPPC,GDP_Growth,GINI,Gov_Debt,Inflation,Life_Exp,Unemployment,Edu
0,Afghanistan,1960,NaN,NaN,NaN,NaN,NaN,32.535,NaN,0.37
1,Albania,1960,NaN,NaN,NaN,NaN,NaN,54.439,NaN,2.98
2,United Arab Emirates,1960,NaN,NaN,NaN,NaN,NaN,48.811,NaN,1.51
3,Argentina,1960,7410.305029,NaN,NaN,NaN,NaN,63.978,NaN,5.67
4,Armenia,1960,NaN,NaN,NaN,NaN,NaN,61.431,NaN,7.91

In [25]:
len(Econ_data)

1342

In [26]:
Econ_data['country'].nunique()

122

In [27]:
Life_Exp['country'].nunique()

266

In [31]:
# Econ_data.to_csv('Data/Clean/Combined/Econ_data.csv', index = False)

In [32]:
# Updating Year Column
Econ_data = Econ_data.rename(columns={Econ_data.columns[1]: 'Year'})

NameError: name 'Mil_Exp' is not defined

In [ ]:
# Updating Year Column
Econ_data = Econ_data.rename(columns={Econ_data.columns[0]: 'Country'})

In [29]:
# Bringing in the DV
PI = pd.read_csv('Data/Clean/Political/PI.csv')
PI.head()

       Country  Year PI
0  Afghanistan  1950  0
1  Afghanistan  1951  0
2  Afghanistan  1952  0
3  Afghanistan  1953  0
4  Afghanistan  1954  0

In [3]:
final_df = pd.merge(Econ_data, PI, on=['Country', 'Year'])

NameError: name 'pd' is not defined

In [4]:
final_df.head()

NameError: name 'final_df' is not defined

In [ ]:
# Exporting Combined df
final_df.to_csv('Data/Clean/Combined/Economic-Data.csv', index = False)